zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_SCB.h
/* S32_SCB - Peripheral instance base addresses */
/** Peripheral S32_SCB base address */
#define S32_SCB_BASE                             (0xE000E000u)
/** Peripheral S32_SCB base pointer */
#define S32_SCB                                  ((S32_SCB_Type *)S32_SCB_BASE)
/** Array initializer of S32_SCB peripheral base addresses */
#define S32_SCB_BASE_ADDRS                       { S32_SCB_BASE }
/** Array initializer of S32_SCB peripheral base pointers */
#define S32_SCB_BASE_PTRS                        { S32_SCB }

/* ----------------------------------------------------------------------------
   -- S32_SCB Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup S32_SCB_Register_Masks S32_SCB Register Masks
 * @{
 */

/* ACTLR Bit Fields */
#define S32_SCB_ACTLR_ACTLR_MASK                 0xFFFFFFFFu
#define S32_SCB_ACTLR_ACTLR_SHIFT                0u
#define S32_SCB_ACTLR_ACTLR_WIDTH                32u
#define S32_SCB_ACTLR_ACTLR(x)                   (((uint32_t)(((uint32_t)(x))<<S32_SCB_ACTLR_ACTLR_SHIFT))&S32_SCB_ACTLR_ACTLR_MASK)
/* CPUID Bit Fields */
#define S32_SCB_CPUID_REVISION_MASK              0xFu
#define S32_SCB_CPUID_REVISION_SHIFT             0u
#define S32_SCB_CPUID_REVISION_WIDTH             4u
#define S32_SCB_CPUID_REVISION(x)                (((uint32_t)(((uint32_t)(x))<<S32_SCB_CPUID_REVISION_SHIFT))&S32_SCB_CPUID_REVISION_MASK)
#define S32_SCB_CPUID_PARTNO_MASK                0xFFF0u
#define S32_SCB_CPUID_PARTNO_SHIFT               4u
#define S32_SCB_CPUID_PARTNO_WIDTH               12u
#define S32_SCB_CPUID_PARTNO(x)                  (((uint32_t)(((uint32_t)(x))<<S32_SCB_CPUID_PARTNO_SHIFT))&S32_SCB_CPUID_PARTNO_MASK)
#define S32_SCB_CPUID_VARIANT_MASK               0xF00000u
#define S32_SCB_CPUID_VARIANT_SHIFT              20u
#define S32_SCB_CPUID_VARIANT_WIDTH              4u
#define S32_SCB_CPUID_VARIANT(x)                 (((uint32_t)(((uint32_t)(x))<<S32_SCB_CPUID_VARIANT_SHIFT))&S32_SCB_CPUID_VARIANT_MASK)
#define S32_SCB_CPUID_IMPLEMENTER_MASK           0xFF000000u
#define S32_SCB_CPUID_IMPLEMENTER_SHIFT          24u
#define S32_SCB_CPUID_IMPLEMENTER_WIDTH          8u
#define S32_SCB_CPUID_IMPLEMENTER(x)             (((uint32_t)(((uint32_t)(x))<<S32_SCB_CPUID_IMPLEMENTER_SHIFT))&S32_SCB_CPUID_IMPLEMENTER_MASK)
/* ICSR Bit Fields */
#define S32_SCB_ICSR_VECTACTIVE_MASK             0x1FFu
#define S32_SCB_ICSR_VECTACTIVE_SHIFT            0u
#define S32_SCB_ICSR_VECTACTIVE_WIDTH            9u
#define S32_SCB_ICSR_VECTACTIVE(x)               (((uint32_t)(((uint32_t)(x))<<S32_SCB_ICSR_VECTACTIVE_SHIFT))&S32_SCB_ICSR_VECTACTIVE_MASK)
#define S32_SCB_ICSR_RETTOBASE_MASK              0x800u
#define S32_SCB_ICSR_RETTOBASE_SHIFT             11u
#define S32_SCB_ICSR_RETTOBASE_WIDTH             1u
#define S32_SCB_ICSR_RETTOBASE(x)                (((uint32_t)(((uint32_t)(x))<<S32_SCB_ICSR_RETTOBASE_SHIFT))&S32_SCB_ICSR_RETTOBASE_MASK)
#define S32_SCB_ICSR_VECTPENDING_MASK            0x3F000u
#define S32_SCB_ICSR_VECTPENDING_SHIFT           12u
#define S32_SCB_ICSR_VECTPENDING_WIDTH           6u
#define S32_SCB_ICSR_VECTPENDING(x)              (((uint32_t)(((uint32_t)(x))<<S32_SCB_ICSR_VECTPENDING_SHIFT))&S32_SCB_ICSR_VECTPENDING_MASK)
#define S32_SCB_ICSR_ISRPENDING_MASK             0x400000u
#define S32_SCB_ICSR_ISRPENDING_SHIFT            22u
#define S32_SCB_ICSR_ISRPENDING_WIDTH            1u
#define S32_SCB_ICSR_ISRPENDING(x)               (((uint32_t)(((uint32_t)(x))<<S32_SCB_ICSR_ISRPENDING_SHIFT))&S32_SCB_ICSR_ISRPENDING_MASK)
#define S32_SCB_ICSR_ISRPREEMPT_MASK             0x800000u
#define S32_SCB_ICSR_ISRPREEMPT_SHIFT            23u
#define S32_SCB_ICSR_ISRPREEMPT_WIDTH            1u
#define S32_SCB_ICSR_ISRPREEMPT(x)               (((uint32_t)(((uint32_t)(x))<<S32_SCB_ICSR_ISRPREEMPT_SHIFT))&S32_SCB_ICSR_ISRPREEMPT_MASK)
#define S32_SCB_ICSR_PENDSTCLR_MASK              0x2000000u
#define S32_SCB_ICSR_PENDSTCLR_SHIFT             25u
#define S32_SCB_ICSR_PENDSTCLR_WIDTH             1u
#define S32_SCB_ICSR_PENDSTCLR(x)                (((uint32_t)(((uint32_t)(x))<<S32_SCB_ICSR_PENDSTCLR_SHIFT))&S32_SCB_ICSR_PENDSTCLR_MASK)
#define S32_SCB_ICSR_PENDSTSET_MASK              0x4000000u
#define S32_SCB_ICSR_PENDSTSET_SHIFT             26u
#define S32_SCB_ICSR_PENDSTSET_WIDTH             1u
#define S32_SCB_ICSR_PENDSTSET(x)                (((uint32_t)(((uint32_t)(x))<<S32_SCB_ICSR_PENDSTSET_SHIFT))&S32_SCB_ICSR_PENDSTSET_MASK)
#define S32_SCB_ICSR_PENDSVCLR_MASK              0x8000000u
#define S32_SCB_ICSR_PENDSVCLR_SHIFT             27u
#define S32_SCB_ICSR_PENDSVCLR_WIDTH             1u
#define S32_SCB_ICSR_PENDSVCLR(x)                (((uint32_t)(((uint32_t)(x))<<S32_SCB_ICSR_PENDSVCLR_SHIFT))&S32_SCB_ICSR_PENDSVCLR_MASK)
#define S32_SCB_ICSR_PENDSVSET_MASK              0x10000000u
#define S32_SCB_ICSR_PENDSVSET_SHIFT             28u
#define S32_SCB_ICSR_PENDSVSET_WIDTH             1u
#define S32_SCB_ICSR_PENDSVSET(x)                (((uint32_t)(((uint32_t)(x))<<S32_SCB_ICSR_PENDSVSET_SHIFT))&S32_SCB_ICSR_PENDSVSET_MASK)
#define S32_SCB_ICSR_NMIPENDSET_MASK             0x80000000u
#define S32_SCB_ICSR_NMIPENDSET_SHIFT            31u
#define S32_SCB_ICSR_NMIPENDSET_WIDTH            1u
#define S32_SCB_ICSR_NMIPENDSET(x)               (((uint32_t)(((uint32_t)(x))<<S32_SCB_ICSR_NMIPENDSET_SHIFT))&S32_SCB_ICSR_NMIPENDSET_MASK)
/* VTOR Bit Fields */
#define S32_SCB_VTOR_TBLOFF_MASK                 0xFFFFFF80u
#define S32_SCB_VTOR_TBLOFF_SHIFT                7u
#define S32_SCB_VTOR_TBLOFF_WIDTH                25u
#define S32_SCB_VTOR_TBLOFF(x)                   (((uint32_t)(((uint32_t)(x))<<S32_SCB_VTOR_TBLOFF_SHIFT))&S32_SCB_VTOR_TBLOFF_MASK)
/* AIRCR Bit Fields */
#define S32_SCB_AIRCR_AIRCR_MASK                 0xFFFFFFFFu
#define S32_SCB_AIRCR_AIRCR_SHIFT                0u
#define S32_SCB_AIRCR_AIRCR_WIDTH                32u
#define S32_SCB_AIRCR_AIRCR(x)                   (((uint32_t)(((uint32_t)(x))<<S32_SCB_AIRCR_AIRCR_SHIFT))&S32_SCB_AIRCR_AIRCR_MASK)
/* SCR Bit Fields */
#define S32_SCB_SCR_SLEEPONEXIT_MASK             0x2u
#define S32_SCB_SCR_SLEEPONEXIT_SHIFT            1u
#define S32_SCB_SCR_SLEEPONEXIT_WIDTH            1u
#define S32_SCB_SCR_SLEEPONEXIT(x)               (((uint32_t)(((uint32_t)(x))<<S32_SCB_SCR_SLEEPONEXIT_SHIFT))&S32_SCB_SCR_SLEEPONEXIT_MASK)
#define S32_SCB_SCR_SLEEPDEEP_MASK               0x4u
#define S32_SCB_SCR_SLEEPDEEP_SHIFT              2u
#define S32_SCB_SCR_SLEEPDEEP_WIDTH              1u
#define S32_SCB_SCR_SLEEPDEEP(x)                 (((uint32_t)(((uint32_t)(x))<<S32_SCB_SCR_SLEEPDEEP_SHIFT))&S32_SCB_SCR_SLEEPDEEP_MASK)
#define S32_SCB_SCR_SEVONPEND_MASK               0x10u
#define S32_SCB_SCR_SEVONPEND_SHIFT              4u
#define S32_SCB_SCR_SEVONPEND_WIDTH              1u
#define S32_SCB_SCR_SEVONPEND(x)                 (((uint32_t)(((uint32_t)(x))<<S32_SCB_SCR_SEVONPEND_SHIFT))&S32_SCB_SCR_SEVONPEND_MASK)
/* CCR Bit Fields */
#define S32_SCB_CCR_CCR_MASK                     0xFFFFFFFFu
#define S32_SCB_CCR_CCR_SHIFT                    0u
#define S32_SCB_CCR_CCR_WIDTH                    32u
#define S32_SCB_CCR_CCR(x)                       (((uint32_t)(((uint32_t)(x))<<S32_SCB_CCR_CCR_SHIFT))&S32_SCB_CCR_CCR_MASK)
/* SHPR1 Bit Fields */
#define S32_SCB_SHPR1_SHPR1_MASK                 0xFFFFFFFFu
#define S32_SCB_SHPR1_SHPR1_SHIFT                0u
#define S32_SCB_SHPR1_SHPR1_WIDTH                32u
#define S32_SCB_SHPR1_SHPR1(x)                   (((uint32_t)(((uint32_t)(x))<<S32_SCB_SHPR1_SHPR1_SHIFT))&S32_SCB_SHPR1_SHPR1_MASK)
/* SHPR2 Bit Fields */
#define S32_SCB_SHPR2_SHPR2_MASK                 0xFFFFFFFFu
#define S32_SCB_SHPR2_SHPR2_SHIFT                0u
#define S32_SCB_SHPR2_SHPR2_WIDTH                32u
#define S32_SCB_SHPR2_SHPR2(x)                   (((uint32_t)(((uint32_t)(x))<<S32_SCB_SHPR2_SHPR2_SHIFT))&S32_SCB_SHPR2_SHPR2_MASK)
/* SHPR3 Bit Fields */
#define S32_SCB_SHPR3_SHPR3_MASK                 0xFFFFFFFFu
#define S32_SCB_SHPR3_SHPR3_SHIFT                0u
#define S32_SCB_SHPR3_SHPR3_WIDTH                32u
#define S32_SCB_SHPR3_SHPR3(x)                   (((uint32_t)(((uint32_t)(x))<<S32_SCB_SHPR3_SHPR3_SHIFT))&S32_SCB_SHPR3_SHPR3_MASK)
/* SHCSR Bit Fields */
#define S32_SCB_SHCSR_MEMFAULTACT_MASK           0x1u
#define S32_SCB_SHCSR_MEMFAULTACT_SHIFT          0u
#define S32_SCB_SHCSR_MEMFAULTACT_WIDTH          1u
#define S32_SCB_SHCSR_MEMFAULTACT(x)             (((uint32_t)(((uint32_t)(x))<<S32_SCB_SHCSR_MEMFAULTACT_SHIFT))&S32_SCB_SHCSR_MEMFAULTACT_MASK)
#define S32_SCB_SHCSR_BUSFAULTACT_MASK           0x2u
#define S32_SCB_SHCSR_BUSFAULTACT_SHIFT          1u
#define S32_SCB_SHCSR_BUSFAULTACT_WIDTH          1u
#define S32_SCB_SHCSR_BUSFAULTACT(x)             (((uint32_t)(((uint32_t)(x))<<S32_SCB_SHCSR_BUSFAULTACT_SHIFT))&S32_SCB_SHCSR_BUSFAULTACT_MASK)
#define S32_SCB_SHCSR_USGFAULTACT_MASK           0x8u
#define S32_SCB_SHCSR_USGFAULTACT_SHIFT          3u
#define S32_SCB_SHCSR_USGFAULTACT_WIDTH          1u
#define S32_SCB_SHCSR_USGFAULTACT(x)             (((uint32_t)(((uint32_t)(x))<<S32_SCB_SHCSR_USGFAULTACT_SHIFT))&S32_SCB_SHCSR_USGFAULTACT_MASK)
#define S32_SCB_SHCSR_SVCALLACT_MASK             0x80u
#define S32_SCB_SHCSR_SVCALLACT_SHIFT            7u
#define S32_SCB_SHCSR_SVCALLACT_WIDTH            1u
#define S32_SCB_SHCSR_SVCALLACT(x)               (((uint32_t)(((uint32_t)(x))<<S32_SCB_SHCSR_SVCALLACT_SHIFT))&S32_SCB_SHCSR_SVCALLACT_MASK)
#define S32_SCB_SHCSR_MONITORACT_MASK            0x100u
#define S32_SCB_SHCSR_MONITORACT_SHIFT           8u
#define S32_SCB_SHCSR_MONITORACT_WIDTH           1u
#define S32_SCB_SHCSR_MONITORACT(x)              (((uint32_t)(((uint32_t)(x))<<S32_SCB_SHCSR_MONITORACT_SHIFT))&S32_SCB_SHCSR_MONITORACT_MASK)
#define S32_SCB_SHCSR_PENDSVACT_MASK             0x400u
#define S32_SCB_SHCSR_PENDSVACT_SHIFT            10u
#define S32_SCB_SHCSR_PENDSVACT_WIDTH            1u
#define S32_SCB_SHCSR_PENDSVACT(x)               (((uint32_t)(((uint32_t)(x))<<S32_SCB_SHCSR_PENDSVACT_SHIFT))&S32_SCB_SHCSR_PENDSVACT_MASK)
#define S32_SCB_SHCSR_SYSTICKACT_MASK            0x800u
#define S32_SCB_SHCSR_SYSTICKACT_SHIFT           11u
#define S32_SCB_SHCSR_SYSTICKACT_WIDTH           1u
#define S32_SCB_SHCSR_SYSTICKACT(x)              (((uint32_t)(((uint32_t)(x))<<S32_SCB_SHCSR_SYSTICKACT_SHIFT))&S32_SCB_SHCSR_SYSTICKACT_MASK)
#define S32_SCB_SHCSR_USGFAULTPENDED_MASK        0x1000u
#define S32_SCB_SHCSR_USGFAULTPENDED_SHIFT       12u
#define S32_SCB_SHCSR_USGFAULTPENDED_WIDTH       1u
#define S32_SCB_SHCSR_USGFAULTPENDED(x)          (((uint32_t)(((uint32_t)(x))<<S32_SCB_SHCSR_USGFAULTPENDED_SHIFT))&S32_SCB_SHCSR_USGFAULTPENDED_MASK)
#define S32_SCB_SHCSR_MEMFAULTPENDED_MASK        0x2000u
#define S32_SCB_SHCSR_MEMFAULTPENDED_SHIFT       13u
#define S32_SCB_SHCSR_MEMFAULTPENDED_WIDTH       1u
#define S32_SCB_SHCSR_MEMFAULTPENDED(x)          (((uint32_t)(((uint32_t)(x))<<S32_SCB_SHCSR_MEMFAULTPENDED_SHIFT))&S32_SCB_SHCSR_MEMFAULTPENDED_MASK)
#define S32_SCB_SHCSR_BUSFAULTPENDED_MASK        0x4000u
#define S32_SCB_SHCSR_BUSFAULTPENDED_SHIFT       14u
#define S32_SCB_SHCSR_BUSFAULTPENDED_WIDTH       1u
#define S32_SCB_SHCSR_BUSFAULTPENDED(x)          (((uint32_t)(((uint32_t)(x))<<S32_SCB_SHCSR_BUSFAULTPENDED_SHIFT))&S32_SCB_SHCSR_BUSFAULTPENDED_MASK)
#define S32_SCB_SHCSR_SVCALLPENDED_MASK          0x8000u
#define S32_SCB_SHCSR_SVCALLPENDED_SHIFT         15u
#define S32_SCB_SHCSR_SVCALLPENDED_WIDTH         1u
#define S32_SCB_SHCSR_SVCALLPENDED(x)            (((uint32_t)(((uint32_t)(x))<<S32_SCB_SHCSR_SVCALLPENDED_SHIFT))&S32_SCB_SHCSR_SVCALLPENDED_MASK)
#define S32_SCB_SHCSR_MEMFAULTENA_MASK           0x10000u
#define S32_SCB_SHCSR_MEMFAULTENA_SHIFT          16u
#define S32_SCB_SHCSR_MEMFAULTENA_WIDTH          1u
#define S32_SCB_SHCSR_MEMFAULTENA(x)             (((uint32_t)(((uint32_t)(x))<<S32_SCB_SHCSR_MEMFAULTENA_SHIFT))&S32_SCB_SHCSR_MEMFAULTENA_MASK)
#define S32_SCB_SHCSR_BUSFAULTENA_MASK           0x20000u
#define S32_SCB_SHCSR_BUSFAULTENA_SHIFT          17u
#define S32_SCB_SHCSR_BUSFAULTENA_WIDTH          1u
#define S32_SCB_SHCSR_BUSFAULTENA(x)             (((uint32_t)(((uint32_t)(x))<<S32_SCB_SHCSR_BUSFAULTENA_SHIFT))&S32_SCB_SHCSR_BUSFAULTENA_MASK)
#define S32_SCB_SHCSR_USGFAULTENA_MASK           0x40000u
#define S32_SCB_SHCSR_USGFAULTENA_SHIFT          18u
#define S32_SCB_SHCSR_USGFAULTENA_WIDTH          1u
#define S32_SCB_SHCSR_USGFAULTENA(x)             (((uint32_t)(((uint32_t)(x))<<S32_SCB_SHCSR_USGFAULTENA_SHIFT))&S32_SCB_SHCSR_USGFAULTENA_MASK)
/* CFSR Bit Fields */
#define S32_SCB_CFSR_MMFSR_IACCVIOL_MASK         0x1u
#define S32_SCB_CFSR_MMFSR_IACCVIOL_SHIFT        0u
#define S32_SCB_CFSR_MMFSR_IACCVIOL_WIDTH        1u
#define S32_SCB_CFSR_MMFSR_IACCVIOL(x)           (((uint32_t)(((uint32_t)(x))<<S32_SCB_CFSR_MMFSR_IACCVIOL_SHIFT))&S32_SCB_CFSR_MMFSR_IACCVIOL_MASK)
#define S32_SCB_CFSR_MMFSR_DACCVIOL_MASK         0x2u
#define S32_SCB_CFSR_MMFSR_DACCVIOL_SHIFT        1u
#define S32_SCB_CFSR_MMFSR_DACCVIOL_WIDTH        1u
#define S32_SCB_CFSR_MMFSR_DACCVIOL(x)           (((uint32_t)(((uint32_t)(x))<<S32_SCB_CFSR_MMFSR_DACCVIOL_SHIFT))&S32_SCB_CFSR_MMFSR_DACCVIOL_MASK)
#define S32_SCB_CFSR_MMFSR_MUNSTKERR_MASK        0x8u
#define S32_SCB_CFSR_MMFSR_MUNSTKERR_SHIFT       3u
#define S32_SCB_CFSR_MMFSR_MUNSTKERR_WIDTH       1u
#define S32_SCB_CFSR_MMFSR_MUNSTKERR(x)          (((uint32_t)(((uint32_t)(x))<<S32_SCB_CFSR_MMFSR_MUNSTKERR_SHIFT))&S32_SCB_CFSR_MMFSR_MUNSTKERR_MASK)
#define S32_SCB_CFSR_MMFSR_MSTKERR_MASK          0x10u
#define S32_SCB_CFSR_MMFSR_MSTKERR_SHIFT         4u
#define S32_SCB_CFSR_MMFSR_MSTKERR_WIDTH         1u
#define S32_SCB_CFSR_MMFSR_MSTKERR(x)            (((uint32_t)(((uint32_t)(x))<<S32_SCB_CFSR_MMFSR_MSTKERR_SHIFT))&S32_SCB_CFSR_MMFSR_MSTKERR_MASK)
#define S32_SCB_CFSR_MMFSR_MLSPERR_MASK          0x20u
#define S32_SCB_CFSR_MMFSR_MLSPERR_SHIFT         5u
#define S32_SCB_CFSR_MMFSR_MLSPERR_WIDTH         1u
#define S32_SCB_CFSR_MMFSR_MLSPERR(x)            (((uint32_t)(((uint32_t)(x))<<S32_SCB_CFSR_MMFSR_MLSPERR_SHIFT))&S32_SCB_CFSR_MMFSR_MLSPERR_MASK)
#define S32_SCB_CFSR_MMFSR_MMARVALID_MASK        0x80u
#define S32_SCB_CFSR_MMFSR_MMARVALID_SHIFT       7u
#define S32_SCB_CFSR_MMFSR_MMARVALID_WIDTH       1u
#define S32_SCB_CFSR_MMFSR_MMARVALID(x)          (((uint32_t)(((uint32_t)(x))<<S32_SCB_CFSR_MMFSR_MMARVALID_SHIFT))&S32_SCB_CFSR_MMFSR_MMARVALID_MASK)
#define S32_SCB_CFSR_BFSR_IBUSERR_MASK           0x100u
#define S32_SCB_CFSR_BFSR_IBUSERR_SHIFT          8u
#define S32_SCB_CFSR_BFSR_IBUSERR_WIDTH          1u
#define S32_SCB_CFSR_BFSR_IBUSERR(x)             (((uint32_t)(((uint32_t)(x))<<S32_SCB_CFSR_BFSR_IBUSERR_SHIFT))&S32_SCB_CFSR_BFSR_IBUSERR_MASK)
#define S32_SCB_CFSR_BFSR_PRECISERR_MASK         0x200u
#define S32_SCB_CFSR_BFSR_PRECISERR_SHIFT        9u
#define S32_SCB_CFSR_BFSR_PRECISERR_WIDTH        1u
#define S32_SCB_CFSR_BFSR_PRECISERR(x)           (((uint32_t)(((uint32_t)(x))<<S32_SCB_CFSR_BFSR_PRECISERR_SHIFT))&S32_SCB_CFSR_BFSR_PRECISERR_MASK)
#define S32_SCB_CFSR_BFSR_IMPRECISERR_MASK       0x400u
#define S32_SCB_CFSR_BFSR_IMPRECISERR_SHIFT      10u
#define S32_SCB_CFSR_BFSR_IMPRECISERR_WIDTH      1u
#define S32_SCB_CFSR_BFSR_IMPRECISERR(x)         (((uint32_t)(((uint32_t)(x))<<S32_SCB_CFSR_BFSR_IMPRECISERR_SHIFT))&S32_SCB_CFSR_BFSR_IMPRECISERR_MASK)
#define S32_SCB_CFSR_BFSR_UNSTKERR_MASK          0x800u
#define S32_SCB_CFSR_BFSR_UNSTKERR_SHIFT         11u
#define S32_SCB_CFSR_BFSR_UNSTKERR_WIDTH         1u
#define S32_SCB_CFSR_BFSR_UNSTKERR(x)            (((uint32_t)(((uint32_t)(x))<<S32_SCB_CFSR_BFSR_UNSTKERR_SHIFT))&S32_SCB_CFSR_BFSR_UNSTKERR_MASK)
#define S32_SCB_CFSR_BFSR_STKERR_MASK            0x1000u
#define S32_SCB_CFSR_BFSR_STKERR_SHIFT           12u
#define S32_SCB_CFSR_BFSR_STKERR_WIDTH           1u
#define S32_SCB_CFSR_BFSR_STKERR(x)              (((uint32_t)(((uint32_t)(x))<<S32_SCB_CFSR_BFSR_STKERR_SHIFT))&S32_SCB_CFSR_BFSR_STKERR_MASK)
#define S32_SCB_CFSR_BFSR_LSPERR_MASK            0x2000u
#define S32_SCB_CFSR_BFSR_LSPERR_SHIFT           13u
#define S32_SCB_CFSR_BFSR_LSPERR_WIDTH           1u
#define S32_SCB_CFSR_BFSR_LSPERR(x)              (((uint32_t)(((uint32_t)(x))<<S32_SCB_CFSR_BFSR_LSPERR_SHIFT))&S32_SCB_CFSR_BFSR_LSPERR_MASK)
#define S32_SCB_CFSR_BFSR_BFARVALID_MASK         0x8000u
#define S32_SCB_CFSR_BFSR_BFARVALID_SHIFT        15u
#define S32_SCB_CFSR_BFSR_BFARVALID_WIDTH        1u
#define S32_SCB_CFSR_BFSR_BFARVALID(x)           (((uint32_t)(((uint32_t)(x))<<S32_SCB_CFSR_BFSR_BFARVALID_SHIFT))&S32_SCB_CFSR_BFSR_BFARVALID_MASK)
#define S32_SCB_CFSR_UFSR_UNDEFINSTR_MASK        0x10000u
#define S32_SCB_CFSR_UFSR_UNDEFINSTR_SHIFT       16u
#define S32_SCB_CFSR_UFSR_UNDEFINSTR_WIDTH       1u
#define S32_SCB_CFSR_UFSR_UNDEFINSTR(x)          (((uint32_t)(((uint32_t)(x))<<S32_SCB_CFSR_UFSR_UNDEFINSTR_SHIFT))&S32_SCB_CFSR_UFSR_UNDEFINSTR_MASK)
#define S32_SCB_CFSR_UFSR_INVSTATE_MASK          0x20000u
#define S32_SCB_CFSR_UFSR_INVSTATE_SHIFT         17u
#define S32_SCB_CFSR_UFSR_INVSTATE_WIDTH         1u
#define S32_SCB_CFSR_UFSR_INVSTATE(x)            (((uint32_t)(((uint32_t)(x))<<S32_SCB_CFSR_UFSR_INVSTATE_SHIFT))&S32_SCB_CFSR_UFSR_INVSTATE_MASK)
#define S32_SCB_CFSR_UFSR_INVPC_MASK             0x40000u
#define S32_SCB_CFSR_UFSR_INVPC_SHIFT            18u
#define S32_SCB_CFSR_UFSR_INVPC_WIDTH            1u
#define S32_SCB_CFSR_UFSR_INVPC(x)               (((uint32_t)(((uint32_t)(x))<<S32_SCB_CFSR_UFSR_INVPC_SHIFT))&S32_SCB_CFSR_UFSR_INVPC_MASK)
#define S32_SCB_CFSR_UFSR_NOCP_MASK              0x80000u
#define S32_SCB_CFSR_UFSR_NOCP_SHIFT             19u
#define S32_SCB_CFSR_UFSR_NOCP_WIDTH             1u
#define S32_SCB_CFSR_UFSR_NOCP(x)                (((uint32_t)(((uint32_t)(x))<<S32_SCB_CFSR_UFSR_NOCP_SHIFT))&S32_SCB_CFSR_UFSR_NOCP_MASK)
#define S32_SCB_CFSR_UFSR_UNALIGNED_MASK         0x1000000u
#define S32_SCB_CFSR_UFSR_UNALIGNED_SHIFT        24u
#define S32_SCB_CFSR_UFSR_UNALIGNED_WIDTH        1u
#define S32_SCB_CFSR_UFSR_UNALIGNED(x)           (((uint32_t)(((uint32_t)(x))<<S32_SCB_CFSR_UFSR_UNALIGNED_SHIFT))&S32_SCB_CFSR_UFSR_UNALIGNED_MASK)
#define S32_SCB_CFSR_UFSR_DIVBYZERO_MASK         0x2000000u
#define S32_SCB_CFSR_UFSR_DIVBYZERO_SHIFT        25u
#define S32_SCB_CFSR_UFSR_DIVBYZERO_WIDTH        1u
#define S32_SCB_CFSR_UFSR_DIVBYZERO(x)           (((uint32_t)(((uint32_t)(x))<<S32_SCB_CFSR_UFSR_DIVBYZERO_SHIFT))&S32_SCB_CFSR_UFSR_DIVBYZERO_MASK)
/* HFSR Bit Fields */
#define S32_SCB_HFSR_HFSR_MASK                   0xFFFFFFFFu
#define S32_SCB_HFSR_HFSR_SHIFT                  0u
#define S32_SCB_HFSR_HFSR_WIDTH                  32u
#define S32_SCB_HFSR_HFSR(x)                     (((uint32_t)(((uint32_t)(x))<<S32_SCB_HFSR_HFSR_SHIFT))&S32_SCB_HFSR_HFSR_MASK)
/* DFSR Bit Fields */
#define S32_SCB_DFSR_DFSR_MASK                   0xFFFFFFFFu
#define S32_SCB_DFSR_DFSR_SHIFT                  0u
#define S32_SCB_DFSR_DFSR_WIDTH                  32u
#define S32_SCB_DFSR_DFSR(x)                     (((uint32_t)(((uint32_t)(x))<<S32_SCB_DFSR_DFSR_SHIFT))&S32_SCB_DFSR_DFSR_MASK)
/* MMFAR Bit Fields */
#define S32_SCB_MMFAR_MMFAR_MASK                 0xFFFFFFFFu
#define S32_SCB_MMFAR_MMFAR_SHIFT                0u
#define S32_SCB_MMFAR_MMFAR_WIDTH                32u
#define S32_SCB_MMFAR_MMFAR(x)                   (((uint32_t)(((uint32_t)(x))<<S32_SCB_MMFAR_MMFAR_SHIFT))&S32_SCB_MMFAR_MMFAR_MASK)
/* BFAR Bit Fields */
#define S32_SCB_BFAR_BFAR_MASK                   0xFFFFFFFFu
#define S32_SCB_BFAR_BFAR_SHIFT                  0u
#define S32_SCB_BFAR_BFAR_WIDTH                  32u
#define S32_SCB_BFAR_BFAR(x)                     (((uint32_t)(((uint32_t)(x))<<S32_SCB_BFAR_BFAR_SHIFT))&S32_SCB_BFAR_BFAR_MASK)
/* AFSR Bit Fields */
#define S32_SCB_AFSR_AFSR_MASK                   0xFFFFFFFFu
#define S32_SCB_AFSR_AFSR_SHIFT                  0u
#define S32_SCB_AFSR_AFSR_WIDTH                  32u
#define S32_SCB_AFSR_AFSR(x)                     (((uint32_t)(((uint32_t)(x))<<S32_SCB_AFSR_AFSR_SHIFT))&S32_SCB_AFSR_AFSR_MASK)
/* ID_PFR0 Bit Fields */
#define S32_SCB_ID_PFR0_ID_PFR0_MASK             0xFFFFFFFFu
#define S32_SCB_ID_PFR0_ID_PFR0_SHIFT            0u
#define S32_SCB_ID_PFR0_ID_PFR0_WIDTH            32u
#define S32_SCB_ID_PFR0_ID_PFR0(x)               (((uint32_t)(((uint32_t)(x))<<S32_SCB_ID_PFR0_ID_PFR0_SHIFT))&S32_SCB_ID_PFR0_ID_PFR0_MASK)
/* ID_PFR1 Bit Fields */
#define S32_SCB_ID_PFR1_ID_PFR1_MASK             0xFFFFFFFFu
#define S32_SCB_ID_PFR1_ID_PFR1_SHIFT            0u
#define S32_SCB_ID_PFR1_ID_PFR1_WIDTH            32u
#define S32_SCB_ID_PFR1_ID_PFR1(x)               (((uint32_t)(((uint32_t)(x))<<S32_SCB_ID_PFR1_ID_PFR1_SHIFT))&S32_SCB_ID_PFR1_ID_PFR1_MASK)
/* ID_DFR0 Bit Fields */
#define S32_SCB_ID_DFR0_ID_DFR0_MASK             0xFFFFFFFFu
#define S32_SCB_ID_DFR0_ID_DFR0_SHIFT            0u
#define S32_SCB_ID_DFR0_ID_DFR0_WIDTH            32u
#define S32_SCB_ID_DFR0_ID_DFR0(x)               (((uint32_t)(((uint32_t)(x))<<S32_SCB_ID_DFR0_ID_DFR0_SHIFT))&S32_SCB_ID_DFR0_ID_DFR0_MASK)
/* ID_AFR0 Bit Fields */
#define S32_SCB_ID_AFR0_ID_AFR0_MASK             0xFFFFFFFFu
#define S32_SCB_ID_AFR0_ID_AFR0_SHIFT            0u
#define S32_SCB_ID_AFR0_ID_AFR0_WIDTH            32u
#define S32_SCB_ID_AFR0_ID_AFR0(x)               (((uint32_t)(((uint32_t)(x))<<S32_SCB_ID_AFR0_ID_AFR0_SHIFT))&S32_SCB_ID_AFR0_ID_AFR0_MASK)
/* ID_MMFR Bit Fields */
#define S32_SCB_ID_MMFR_ID_MMFR0_MASK            0xFFFFFFFFu
#define S32_SCB_ID_MMFR_ID_MMFR0_SHIFT           0u
#define S32_SCB_ID_MMFR_ID_MMFR0_WIDTH           32u
#define S32_SCB_ID_MMFR_ID_MMFR0(x)              (((uint32_t)(((uint32_t)(x))<<S32_SCB_ID_MMFR_ID_MMFR0_SHIFT))&S32_SCB_ID_MMFR_ID_MMFR0_MASK)
#define S32_SCB_ID_MMFR_ID_MMFR1_MASK            0xFFFFFFFFu
#define S32_SCB_ID_MMFR_ID_MMFR1_SHIFT           0u
#define S32_SCB_ID_MMFR_ID_MMFR1_WIDTH           32u
#define S32_SCB_ID_MMFR_ID_MMFR1(x)              (((uint32_t)(((uint32_t)(x))<<S32_SCB_ID_MMFR_ID_MMFR1_SHIFT))&S32_SCB_ID_MMFR_ID_MMFR1_MASK)
#define S32_SCB_ID_MMFR_ID_MMFR2_MASK            0xFFFFFFFFu
#define S32_SCB_ID_MMFR_ID_MMFR2_SHIFT           0u
#define S32_SCB_ID_MMFR_ID_MMFR2_WIDTH           32u
#define S32_SCB_ID_MMFR_ID_MMFR2(x)              (((uint32_t)(((uint32_t)(x))<<S32_SCB_ID_MMFR_ID_MMFR2_SHIFT))&S32_SCB_ID_MMFR_ID_MMFR2_MASK)
#define S32_SCB_ID_MMFR_ID_MMFR3_MASK            0xFFFFFFFFu
#define S32_SCB_ID_MMFR_ID_MMFR3_SHIFT           0u
#define S32_SCB_ID_MMFR_ID_MMFR3_WIDTH           32u
#define S32_SCB_ID_MMFR_ID_MMFR3(x)              (((uint32_t)(((uint32_t)(x))<<S32_SCB_ID_MMFR_ID_MMFR3_SHIFT))&S32_SCB_ID_MMFR_ID_MMFR3_MASK)
/* ID_ISAR Bit Fields */
#define S32_SCB_ID_ISAR_ID_ISAR0_MASK            0xFFFFFFFFu
#define S32_SCB_ID_ISAR_ID_ISAR0_SHIFT           0u
#define S32_SCB_ID_ISAR_ID_ISAR0_WIDTH           32u
#define S32_SCB_ID_ISAR_ID_ISAR0(x)              (((uint32_t)(((uint32_t)(x))<<S32_SCB_ID_ISAR_ID_ISAR0_SHIFT))&S32_SCB_ID_ISAR_ID_ISAR0_MASK)
#define S32_SCB_ID_ISAR_ID_ISAR1_MASK            0xFFFFFFFFu
#define S32_SCB_ID_ISAR_ID_ISAR1_SHIFT           0u
#define S32_SCB_ID_ISAR_ID_ISAR1_WIDTH           32u
#define S32_SCB_ID_ISAR_ID_ISAR1(x)              (((uint32_t)(((uint32_t)(x))<<S32_SCB_ID_ISAR_ID_ISAR1_SHIFT))&S32_SCB_ID_ISAR_ID_ISAR1_MASK)
#define S32_SCB_ID_ISAR_ID_ISAR2_MASK            0xFFFFFFFFu
#define S32_SCB_ID_ISAR_ID_ISAR2_SHIFT           0u
#define S32_SCB_ID_ISAR_ID_ISAR2_WIDTH           32u
#define S32_SCB_ID_ISAR_ID_ISAR2(x)              (((uint32_t)(((uint32_t)(x))<<S32_SCB_ID_ISAR_ID_ISAR2_SHIFT))&S32_SCB_ID_ISAR_ID_ISAR2_MASK)
#define S32_SCB_ID_ISAR_ID_ISAR3_MASK            0xFFFFFFFFu
#define S32_SCB_ID_ISAR_ID_ISAR3_SHIFT           0u
#define S32_SCB_ID_ISAR_ID_ISAR3_WIDTH           32u
#define S32_SCB_ID_ISAR_ID_ISAR3(x)              (((uint32_t)(((uint32_t)(x))<<S32_SCB_ID_ISAR_ID_ISAR3_SHIFT))&S32_SCB_ID_ISAR_ID_ISAR3_MASK)
#define S32_SCB_ID_ISAR_ID_ISAR4_MASK            0xFFFFFFFFu
#define S32_SCB_ID_ISAR_ID_ISAR4_SHIFT           0u
